test/nexj/core/persistence/sql/data/readExternal.xml


<!-- Copyright 2010 NexJ Systems Inc. This software is licensed under the terms of the Eclipse Public License 1.0 -->
<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[3]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>ExternalVisit</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>ExternalVisit</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAg==</Item>
            </values>
         </oid>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>ExternalVisit</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAw==</Item>
            </values>
         </oid>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
